Revit 2027 API
ParameterTypeId.RenderRpcFilename Property
 "Render Appearance"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RenderRpcFilename { get; }
Public Shared ReadOnly Property RenderRpcFilename As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RenderRpcFilename {
	ForgeTypeId^ get ();
}
static member RenderRpcFilename : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace